Enhanced README file.
